{"keras_version": "1.2.0", "class_name": "Model", "config": {"layers": [{"name": "input_layer", "class_name": "InputLayer", "config": {"sparse": false, "name": "input_layer", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3]}, "inbound_nodes": []}, {"name": "block1_conv", "class_name": "Convolution2D", "config": {"b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "nb_row": 5, "nb_filter": 48, "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "name": "block1_conv"}, "inbound_nodes": [[["input_layer", 0, 0]]]}, {"name": "block1_bn", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "axis": -1, "name": "block1_bn", "mode": 0, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["block1_conv", 0, 0]]]}, {"name": "block1_act", "class_name": "Activation", "config": {"trainable": true, "name": "block1_act", "activation": "relu"}, "inbound_nodes": [[["block1_bn", 0, 0]]]}, {"name": "block2_conv", "class_name": "Convolution2D", "config": {"b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "nb_row": 5, "nb_filter": 96, "nb_col": 5, "W_constraint": null, "activity_regularizer": null, "activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "name": "block2_conv"}, "inbound_nodes": [[["block1_act", 0, 0]]]}, {"name": "block2_bn", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "axis": -1, "name": "block2_bn", "mode": 0, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["block2_conv", 0, 0]]]}, {"name": "block2_act", "class_name": "Activation", "config": {"trainable": true, "name": "block2_act", "activation": "relu"}, "inbound_nodes": [[["block2_bn", 0, 0]]]}, {"name": "block2_max_pool", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "block2_max_pool"}, "inbound_nodes": [[["block2_act", 0, 0]]]}, {"name": "block3_sepconv", "class_name": "SeparableConvolution2D", "config": {"b_constraint": null, "nb_filter": 192, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "nb_row": 5, "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "depthwise_regularizer": null, "trainable": true, "depth_multiplier": 1, "name": "block3_sepconv", "pointwise_constraint": null, "bias": true}, "inbound_nodes": [[["block2_max_pool", 0, 0]]]}, {"name": "block3_bn", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "axis": -1, "name": "block3_bn", "mode": 0, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["block3_sepconv", 0, 0]]]}, {"name": "block3_act", "class_name": "Activation", "config": {"trainable": true, "name": "block3_act", "activation": "relu"}, "inbound_nodes": [[["block3_bn", 0, 0]]]}, {"name": "block3_max_pool", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "block3_max_pool"}, "inbound_nodes": [[["block3_act", 0, 0]]]}, {"name": "block4_sepconv", "class_name": "SeparableConvolution2D", "config": {"b_constraint": null, "nb_filter": 384, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "depthwise_regularizer": null, "trainable": true, "depth_multiplier": 1, "name": "block4_sepconv", "pointwise_constraint": null, "bias": true}, "inbound_nodes": [[["block3_max_pool", 0, 0]]]}, {"name": "block4_bn", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "axis": -1, "name": "block4_bn", "mode": 0, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["block4_sepconv", 0, 0]]]}, {"name": "block4_act", "class_name": "Activation", "config": {"trainable": true, "name": "block4_act", "activation": "relu"}, "inbound_nodes": [[["block4_bn", 0, 0]]]}, {"name": "block5_sepconv", "class_name": "SeparableConvolution2D", "config": {"b_constraint": null, "nb_filter": 768, "b_regularizer": null, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "nb_row": 3, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "depthwise_constraint": null, "activation": "linear", "pointwise_regularizer": null, "depthwise_regularizer": null, "trainable": true, "depth_multiplier": 1, "name": "block5_sepconv", "pointwise_constraint": null, "bias": true}, "inbound_nodes": [[["block4_act", 0, 0]]]}, {"name": "block5_bn", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "axis": -1, "name": "block5_bn", "mode": 0, "momentum": 0.99, "epsilon": 0.001}, "inbound_nodes": [[["block5_sepconv", 0, 0]]]}, {"name": "block5_act", "class_name": "Activation", "config": {"trainable": true, "name": "block5_act", "activation": "relu"}, "inbound_nodes": [[["block5_bn", 0, 0]]]}, {"name": "avg_pool", "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "avg_pool", "dim_ordering": "tf"}, "inbound_nodes": [[["block5_act", 0, 0]]]}, {"name": "drop_out", "class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "drop_out"}, "inbound_nodes": [[["avg_pool", 0, 0]]]}, {"name": "steering_angle", "class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "trainable": true, "output_dim": 1, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "activation": "linear", "bias": true, "W_regularizer": null, "name": "steering_angle", "input_dim": 768}, "inbound_nodes": [[["drop_out", 0, 0]]]}], "output_layers": [["steering_angle", 0, 0]], "name": "model_1", "input_layers": [["input_layer", 0, 0]]}}